rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TestTitle"], ["rating", "TestRating"], ["description", "TestDesc"], ["created_at", "2018-10-06 21:49:05.362462"], ["updated_at", "2018-10-06 21:49:05.362462"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "movies" SET "title" = $1, "rating" = $2, "description" = $3, "updated_at" = $4 WHERE "movies"."id" = $5  [["title", "ChangeTitle"], ["rating", "ChangeRating"], ["description", "ChangeDesc"], ["updated_at", "2018-10-06 21:57:56.342481"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IN (SELECT "movies"."director" FROM "movies" WHERE "movies"."id" = $1)  [["id", 1]]
---
  def search_directors
    @current_movie = Movie.find(params[:id])
    if @current_movie.director == nil or @current_movie.director == ""
      flash[:notice] = "'#{@current_movie.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.find_with_same_director(params[:id])